RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_canfd.h
/*******************************************************************************
* Function Name: Cy_CANFD_SetTDC
****************************************************************************//**
*
* Sets the CAN FD transceiver delay compensation offset.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*  The CAN FD channel number.
*
* \param *tdcConfig
*  The CAN FD transceiver delay compensation offset configuration.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_SetTDC(CANFD_Type *base, uint32_t chan,
                                     const  cy_stc_canfd_transceiver_delay_compensation_t *tdcConfig)
{
    if (NULL != tdcConfig)
    {
        CY_ASSERT_L2(CY_CANFD_IS_TDCO_VALID(tdcConfig->tdcOffset));
        CY_ASSERT_L2(CY_CANFD_IS_TDCF_VALID(tdcConfig->tdcFilterWindow));

        /* Transceiver Delay Compensation is enabled or disabled */
        CANFD_DBTP(base, chan) = _CLR_SET_FLD32U(CANFD_DBTP(base, chan),
                                         CANFD_CH_M_TTCAN_DBTP_TDC,
                                         ((tdcConfig->tdcEnabled) ? 1UL : 0UL));

        /* Transmitter Delay Compensation Offset and Filter Window Length */
        CANFD_TDCR(base, chan) = _VAL2FLD(CANFD_CH_M_TTCAN_TDCR_TDCO, tdcConfig->tdcOffset) |
                           _VAL2FLD(CANFD_CH_M_TTCAN_TDCR_TDCF, tdcConfig->tdcFilterWindow);
    }
}

/** \} group_canfd_functions */

/**
* \addtogroup group_canfd_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_CANFD_GetInterruptStatus
****************************************************************************//**
*
*  Returns a status of CAN FD interrupt requests.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \return uint32_t
*     The bit mask of the Interrupt Status.
* Valid masks can be found in
* \ref group_canfd_rx_interrupt_masks, \ref group_canfd_tx_interrupt_masks and
* \ref group_canfd_error_interrupt_masks.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetInterruptStatus
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_CANFD_GetInterruptStatus(CANFD_Type const *base, uint32_t chan)
{
    return CANFD_IR(base, chan);
}


/*******************************************************************************
* Function Name: Cy_CANFD_ClearInterrupt
****************************************************************************//**
*
*  Clears CAN FD interrupts by setting each bit.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \param status
*     The bitmask of statuses to clear.
* Valid masks can be found in
* \ref group_canfd_rx_interrupt_masks, \ref group_canfd_tx_interrupt_masks and
* \ref group_canfd_error_interrupt_masks.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_ClearInterrupt
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_ClearInterrupt(CANFD_Type *base, uint32_t chan, uint32_t status)
{
    CANFD_IR(base, chan) = status;
}


/*******************************************************************************
* Function Name: Cy_CANFD_GetInterruptMask
****************************************************************************//**
*
*  Returns an interrupt mask.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \return uint32_t
*     The bit field determines which status changes can cause an interrupt.
* Valid masks can be found in
* \ref group_canfd_rx_interrupt_masks, \ref group_canfd_tx_interrupt_masks and
* \ref group_canfd_error_interrupt_masks.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_CANFD_GetInterruptMask(CANFD_Type const *base, uint32_t chan)
{
    return CANFD_IE(base, chan);
}


/*******************************************************************************
* Function Name: Cy_CANFD_SetInterruptMask
****************************************************************************//**
*
*  Configures which bits of the interrupt request register can trigger an
*  interrupt event.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \param interrupt
*     The bit field determines which status changes can cause an interrupt.
* Valid masks can be found in
* \ref group_canfd_rx_interrupt_masks, \ref group_canfd_tx_interrupt_masks and
* \ref group_canfd_error_interrupt_masks.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_SetInterruptMask
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_SetInterruptMask(CANFD_Type *base, uint32_t chan, uint32_t interrupt)
{
    CANFD_IE(base, chan) = interrupt;
}


/*******************************************************************************
* Function Name: Cy_CANFD_GetInterruptLine
****************************************************************************//**
*
*  Returns the interrupt signals assigned to the line m_ttcan_int0
* or m_ttcan_int1.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \return uint32_t
*     The mask where 1 corresponds to the interrupt signals assigned
*     to the line m_ttcan_int1 and 0 corresponds to m_ttcan_int0.
* Valid masks can be found in
* \ref group_canfd_rx_interrupt_masks, \ref group_canfd_tx_interrupt_masks and
* \ref group_canfd_error_interrupt_masks.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_GetInterruptLine
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_CANFD_GetInterruptLine(CANFD_Type const *base, uint32_t chan)
{
    return CANFD_ILS(base, chan);
}


