RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_canfd.h
/*******************************************************************************
* Function Name: Cy_CANFD_SetInterruptLine
****************************************************************************//**
*
*  Configures the bits of the Interrupt Line Select Register to assign the
*  interrupt signal to the line m_ttcan_int0 or m_ttcan_int1.
*  Bit = 0: The interrupt assigned to the interrupt line m_ttcan_int0,
*  bit = 1: The interrupt assigned to the interrupt line m_ttcan_int1.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \param interruptLineMask
*     The mask where 1 corresponds to the interrupt signals assigned
*     to the line m_ttcan_int1 and 0 corresponds to m_ttcan_int0.
* Valid masks can be found in
* \ref group_canfd_rx_interrupt_masks, \ref group_canfd_tx_interrupt_masks and
* \ref group_canfd_error_interrupt_masks.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_SetInterruptLine
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_SetInterruptLine(CANFD_Type *base, uint32_t chan, uint32_t interruptLineMask)
{
    CANFD_ILS(base, chan) = interruptLineMask;
}


/*******************************************************************************
* Function Name: Cy_CANFD_IsInterruptLineEnabled
****************************************************************************//**
*
*  Checks whether Interrupt Line 0, Interrupt Line 1 or both are enabled.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \param interruptLineMask
*    The bit mask to check which interrupt line is enabled.
*    Can be CY_CANFD_INTERRUPT_LINE_0_EN, CY_CANFD_INTERRUPT_LINE_1_EN or
*    (CY_CANFD_INTERRUPT_LINE_0_EN | CY_CANFD_INTERRUPT_LINE_1_EN)
*
* \return bool
*     The bit mask of the enabled interrupt lines.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_IsInterruptLineEnabled
*
*******************************************************************************/
__STATIC_INLINE bool Cy_CANFD_IsInterruptLineEnabled(CANFD_Type const *base, uint32_t chan,
                                                     uint32_t interruptLineMask)
{
    return (interruptLineMask == (CANFD_ILE(base, chan) & interruptLineMask));
}


/*******************************************************************************
* Function Name: Cy_CANFD_EnableInterruptLine
****************************************************************************//**
*
*  Configures which interrupt line is enabled (Interrupt Line 0, Interrupt Line 1 or both).
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*     The CAN FD channel number.
*
* \param interruptLineMask
*    The bit mask whose bits define interrupt lines to enable or disable.
*
* \funcusage
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_EnableInterruptLine
*
*******************************************************************************/
__STATIC_INLINE void Cy_CANFD_EnableInterruptLine(CANFD_Type *base, uint32_t chan, uint32_t interruptLineMask)
{
    CY_ASSERT_L2(CY_CANFD_IS_ILE_MASK_VALID(interruptLineMask));

    CANFD_ILE(base, chan) = interruptLineMask;
}

/** \} group_canfd_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXTTCANFD */

#endif /* CY_CANFD_H */

/** \} group_canfd */

/* [] END OF FILE */
